[
  {
    "code": "AAAAAAA",
    "codeIndex": 1111111,
    "id": 1,
    "name": [
      "bichon frise",
      "keeshond",
      "maltese",
      "miniature pinscher"
    ],
    "description": [
      "Bichon Frise, a cheerful and affectionate dog breed with a playful personality. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Bichon Frises exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners.",
      "Keeshond, a friendly and lively dog breed known for its distinctive 'spectacles' markings. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Keeshonds exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners.",
      "Maltese, a charming and affectionate toy breed known for its silky white coat. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Maltese exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Miniature Pinscher, a small and energetic dog breed with a confident and lively personality. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Miniature Pinschers exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
    ]
  },
  {
    "code": "AAAAAAB",
    "codeIndex": 1111112,
    "id": 2,
    "name": [
      "pekingese",
      "pomeranian",
      "medium poodle",
      "miniature poodle",
      "standard poodle",
      "toy poodle",
      "pug",
      "sharpei",
      "shihtzu",
      "blenheim spaniel",
      "japanese spaniel",
      "yorkshire terrier"
    ],
    "description": [
      "Pekingese, a small toy breed with a regal appearance and a distinctive mane-like coat. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Pekingese exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Pomeranian, a small and lively toy breed with a fluffy double coat. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Pomeranians exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Medium Poodle, a highly intelligent and versatile dog breed with a curly or wavy coat. They are extremely affectionate companions, suitable for various living spaces, and have a moderate activity level. Medium Poodles exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Miniature Poodle, a highly intelligent and versatile toy breed with a curly or wavy coat. They are extremely affectionate companions, suitable for a small apartment, and have a moderate activity level. Miniature Poodles exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Standard Poodle, a highly intelligent and versatile dog breed with a curly or wavy coat. They are extremely affectionate companions, suitable for various living spaces, and have a moderate activity level. Standard Poodles exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Toy Poodle, a highly intelligent and versatile toy breed with a curly or wavy coat. They are extremely affectionate companions, suitable for a small apartment, and have a moderate activity level. Toy Poodles exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Pug, a charming and affectionate toy breed with a distinctive wrinkled face and curled tail. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Pugs exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Shar Pei, a unique and wrinkled dog breed with a distinctive appearance. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Shar Peis exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Shih Tzu, a small and charming toy breed with a luxurious flowing coat. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Shih Tzus exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Cavalier King Charles Spaniel, a friendly and affectionate toy breed with a distinctive appearance. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Cavaliers exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Japanese Chin, a small and charming toy breed with a distinctive appearance. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Japanese Chins exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care.",
      "Yorkshire Terrier, a small and glamorous toy breed with a beautiful long coat. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Yorkshire Terriers exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care."
    ]
  },
  {
    "code": "AAAAABA",
    "codeIndex": 1111121,
    "id": 3,
    "name": [
      "cotondetulear",
      "havanese"
    ],
    "description": [
      "Coton de Tulear, a charming and affectionate dog breed known for its cotton-like coat. Suited for small apartments, it has low to moderate activity levels and minimal grooming requirements, making it suitable for novice owners.",
      "Havanese, a charming and affectionate dog breed with a playful personality. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Havanese exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
    ]
  },
  {
    "code": "AAAAABB",
    "codeIndex": 1111122,
    "id": 4,
    "name": [
      "cotondetulear",
      "havanese"
    ],
    "description": [
      "Coton de Tulear, a charming and affectionate dog breed known for its cotton-like coat. Suited for small apartments, it has low to moderate activity levels and minimal grooming requirements, making it suitable for novice owners.",
      "Havanese, a charming and affectionate dog breed with a playful personality. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Havanese exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
    ]
  },
  {
    "code": "AAAABAA",
    "codeIndex": 1111211,
    "id": 5,
    "name": [
      "Cockapoo",
      "lhasa"
    ],
    "description": [
      "Cockapoo, a charming and affectionate companion. Small apartment or house with yard. Low to moderate activity. Occasional barking. Suitable for children. Low maintenance. Novice-friendly.",
      "Lhasa Apso, a loyal and independent dog breed with a distinctive long, flowing coat. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Lhasa Apsos exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, requiring regular care."
    ]
  },
  {
    "code": "AAAABAB",
    "codeIndex": 1111212,
    "id": 6,
    "name": "chihuahua",
    "description": "Chihuahua, a tiny and energetic dog breed known for its strong bond with its owner, often preferring a close companionship. They are suitable for small apartments, have a low to moderate activity level, and require consistent grooming. Chihuahuas are generally not suitable for small children and are better for experienced owners."
  },
  {
    "code": "AAAABBA",
    "codeIndex": 1111221,
    "id": 7,
    "name": "chihuahua",
    "description": "Chihuahua, a tiny and energetic dog breed known for its strong bond with its owner, often preferring a close companionship. They are suitable for small apartments, have a low to moderate activity level, and require consistent grooming. Chihuahuas are generally not suitable for small children and are better for experienced owners."
  },
  {
    "code": "AAAABBB",
    "codeIndex": 1111222,
    "id": 8,
    "name": [
      "labradoodle",
      "pembroke"
    ],
    "description": [
      "Labradoodle, a friendly and intelligent hybrid breed known for its curly or wavy coat. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Labradoodles exhibit occasional barking and are generally suitable for families with children. Grooming can vary depending on the coat type, making them suitable for novice owners with proper care.",
      "Pembroke Welsh Corgi, an intelligent and affectionate dog breed with a distinctive appearance. They are extremely affectionate companions, suitable for a small apartment or a house with a yard, and have a low to moderate activity level. Pembroke Welsh Corgis exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
    ]
  },
  {
    "code": "AAABAAA",
    "codeIndex": 1112111,
    "id": 9,
    "name": [
      "labradoodle",
      "pembroke"
    ],
    "description": [
      "Labradoodle, a friendly and intelligent hybrid breed known for its curly or wavy coat. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Labradoodles exhibit occasional barking and are generally suitable for families with children. Grooming can vary depending on the coat type, making them suitable for novice owners with proper care.",
      "Pembroke Welsh Corgi, an intelligent and affectionate dog breed with a distinctive appearance. They are extremely affectionate companions, suitable for a small apartment or a house with a yard, and have a low to moderate activity level. Pembroke Welsh Corgis exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
    ]
  },
  {
    "code": "AAABAAB",
    "codeIndex": 1112112,
    "id": 10,
    "name": [
      "labradoodle",
      "pembroke"
    ],
    "description": [
      "Labradoodle, a friendly and intelligent hybrid breed known for its curly or wavy coat. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Labradoodles exhibit occasional barking and are generally suitable for families with children. Grooming can vary depending on the coat type, making them suitable for novice owners with proper care.",
      "Pembroke Welsh Corgi, an intelligent and affectionate dog breed with a distinctive appearance. They are extremely affectionate companions, suitable for a small apartment or a house with a yard, and have a low to moderate activity level. Pembroke Welsh Corgis exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
    ]
  },
  {
    "code": "AAABABA",
    "codeIndex": 1112121,
    "id": 11,
    "name": "labrador",
    "description": "Labrador Retriever, a friendly and outgoing dog breed known for its intelligence and versatility. They are extremely affectionate companions, suitable for a small apartment or a house with a yard, and have a low to moderate activity level. Labradors exhibit occasional barking and are generally suitable for families with children. Grooming is low maintenance, making them suitable for novice owners."
  },
  {
    "code": "AAABABB",
    "codeIndex": 1112122,
    "id": 12,
    "name": "labrador",
    "description": "Labrador Retriever, a friendly and outgoing dog breed known for its intelligence and versatility. They are extremely affectionate companions, suitable for a small apartment or a house with a yard, and have a low to moderate activity level. Labradors exhibit occasional barking and are generally suitable for families with children. Grooming is low maintenance, making them suitable for novice owners."
  },
  {
    "code": "AAABBAA",
    "codeIndex": 1112211,
    "id": 13,
    "name": [
      "brabancon",
      "mexicanhairless"
    ],
    "description": [
      " Brussels Griffon , an affectionate and energetic companion with high grooming needs. Suited for novice owners in apartments, providing loyalty and a lively family member.",
      "Xoloitzcuintli, also known as the Mexican Hairless Dog, is an ancient and loyal dog breed. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Xoloitzcuintlis exhibit occasional barking and are generally suitable for families with children. Grooming is consistent. Making them suitable for novice owners."
    ]
  },
  {
    "code": "AAABBAB",
    "codeIndex": 1112212,
    "id": 14,
    "name": [
      "brabancon",
      "mexicanhairless"
    ],
    "description": [
      " Brussels Griffon , an affectionate and energetic companion with high grooming needs. Suited for novice owners in apartments, providing loyalty and a lively family member.",
      "Xoloitzcuintli, also known as the Mexican Hairless Dog, is an ancient and loyal dog breed. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Xoloitzcuintlis exhibit occasional barking and are generally suitable for families with children. Grooming is consistent. Making them suitable for novice owners."
    ]
  },
  {
    "code": "AAABBBA",
    "codeIndex": 1112221,
    "id": 15,
    "name": [
      "brabancon",
      "mexicanhairless"
    ],
    "description": [
      " Brussels Griffon , an affectionate and energetic companion with high grooming needs. Suited for novice owners in apartments, providing loyalty and a lively family member.",
      "Xoloitzcuintli, also known as the Mexican Hairless Dog, is an ancient and loyal dog breed. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Xoloitzcuintlis exhibit occasional barking and are generally suitable for families with children. Grooming is consistent. Making them suitable for novice owners."
    ]
  },
  {
    "code": "AAABBBB",
    "codeIndex": 1112222,
    "id": 16,
    "name": "affenpinscher",
    "description": "Affenpinscher, an energetic and loyal companion with high grooming needs. Suited for experienced owners in houses, offering devotion and a lively spirit."
  },
  {
    "code": "AAACAAA",
    "codeIndex": 1113111,
    "id": 17,
    "name": "affenpinscher",
    "description": "Affenpinscher, an energetic and loyal companion with high grooming needs. Suited for experienced owners in houses, offering devotion and a lively spirit."
  },
  {
    "code": "AAACAAB",
    "codeIndex": 1113112,
    "id": 18,
    "name": "affenpinscher",
    "description": "Affenpinscher, an energetic and loyal companion with high grooming needs. Suited for experienced owners in houses, offering devotion and a lively spirit."
  },
  {
    "code": "AAACABA",
    "codeIndex": 1113121,
    "id": 19,
    "name": "affenpinscher",
    "description": "Affenpinscher, an energetic and loyal companion with high grooming needs. Suited for experienced owners in houses, offering devotion and a lively spirit."
  },
  {
    "code": "AAACABB",
    "codeIndex": 1113122,
    "id": 20,
    "name": "boston bulldog",
    "description": "The Olde Boston Bulldogge is a sturdy, loyal companion with low grooming needs. Suited for experienced owners in apartments, offering affection and charm."
  },
  {
    "code": "AAACBAA",
    "codeIndex": 1113211,
    "id": 21,
    "name": "dachshund",
    "description": "Dachshund, a charming and intelligent dog breed with a bold personality, great for companionship, suited for a small apartment, and requiring low to moderate activity. Dachshunds may be naturally vocal but are generally suitable for families with children, especially when supervised."
  },
  {
    "code": "AAACBAB",
    "codeIndex": 1113212,
    "id": 22,
    "name": "dachshund",
    "description": "Dachshund, a charming and intelligent dog breed with a bold personality, great for companionship, suited for a small apartment, and requiring low to moderate activity. Dachshunds may be naturally vocal but are generally suitable for families with children, especially when supervised."
  },
  {
    "code": "AAACBBA",
    "codeIndex": 1113221,
    "id": 23,
    "name": "dachshund",
    "description": "Dachshund, a charming and intelligent dog breed with a bold personality, great for companionship, suited for a small apartment, and requiring low to moderate activity. Dachshunds may be naturally vocal but are generally suitable for families with children, especially when supervised."
  },
  {
    "code": "AAACBBB",
    "codeIndex": 1113222,
    "id": 24,
    "name": [
      "cardigan corgi",
      "papillon",
      "japanese spitz"
    ],
    "description": [
      "Cardigan Corgi, an affectionate and intelligent dog breed with a sturdy build and distinctive features. Well-suited for small apartments, it requires low to moderate grooming and is suitable for families with children.",
      "Papillon, a small and energetic toy breed with distinctive butterfly-like ears. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Papillons exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners.",
      "Japanese Spitz, a small and agile dog breed with a beautiful white coat and a friendly demeanor. They are extremely affectionate companions, suitable for an apartment and a  house with a yard, and require a lot of outdoor activity. Japanese Spitz may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners."
    ]
  },
  {
    "code": "AABAAAA",
    "codeIndex": 1121111,
    "id": 25,
    "name": [
      "cardigan corgi",
      "papillon",
      "japanese spitz"
    ],
    "description": [
      "Cardigan Corgi, an affectionate and intelligent dog breed with a sturdy build and distinctive features. Well-suited for small apartments, it requires low to moderate grooming and is suitable for families with children.",
      "Papillon, a small and energetic toy breed with distinctive butterfly-like ears. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Papillons exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners.",
      "Japanese Spitz, a small and agile dog breed with a beautiful white coat and a friendly demeanor. They are extremely affectionate companions, suitable for an apartment and a  house with a yard, and require a lot of outdoor activity. Japanese Spitz may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners."
    ]
  },
  {
    "code": "AABAAAB",
    "codeIndex": 1121112,
    "id": 26,
    "name": [
      "cardigan corgi",
      "papillon",
      "japanese spitz"
    ],
    "description": [
      "Cardigan Corgi, an affectionate and intelligent dog breed with a sturdy build and distinctive features. Well-suited for small apartments, it requires low to moderate grooming and is suitable for families with children.",
      "Papillon, a small and energetic toy breed with distinctive butterfly-like ears. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Papillons exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners.",
      "Japanese Spitz, a small and agile dog breed with a beautiful white coat and a friendly demeanor. They are extremely affectionate companions, suitable for an apartment and a  house with a yard, and require a lot of outdoor activity. Japanese Spitz may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners."
    ]
  },
  {
    "code": "AABAABA",
    "codeIndex": 1121121,
    "id": 27,
    "name": [
      "cardigan corgi",
      "papillon",
      "japanese spitz"
    ],
    "description": [
      "Cardigan Corgi, an affectionate and intelligent dog breed with a sturdy build and distinctive features. Well-suited for small apartments, it requires low to moderate grooming and is suitable for families with children.",
      "Papillon, a small and energetic toy breed with distinctive butterfly-like ears. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Papillons exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners.",
      "Japanese Spitz, a small and agile dog breed with a beautiful white coat and a friendly demeanor. They are extremely affectionate companions, suitable for an apartment and a  house with a yard, and require a lot of outdoor activity. Japanese Spitz may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners."
    ]
  },
  {
    "code": "AABAABB",
    "codeIndex": 1121122,
    "id": 28,
    "name": [
      "cardigan corgi",
      "papillon",
      "japanese spitz"
    ],
    "description": [
      "Cardigan Corgi, an affectionate and intelligent dog breed with a sturdy build and distinctive features. Well-suited for small apartments, it requires low to moderate grooming and is suitable for families with children.",
      "Papillon, a small and energetic toy breed with distinctive butterfly-like ears. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Papillons exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners.",
      "Japanese Spitz, a small and agile dog breed with a beautiful white coat and a friendly demeanor. They are extremely affectionate companions, suitable for an apartment and a  house with a yard, and require a lot of outdoor activity. Japanese Spitz may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners."
    ]
  },
  {
    "code": "AABABAA",
    "codeIndex": 1121211,
    "id": 29,
    "name": [
      "cardigan corgi",
      "papillon",
      "japanese spitz"
    ],
    "description": [
      "Cardigan Corgi, an affectionate and intelligent dog breed with a sturdy build and distinctive features. Well-suited for small apartments, it requires low to moderate grooming and is suitable for families with children.",
      "Papillon, a small and energetic toy breed with distinctive butterfly-like ears. They are extremely affectionate companions, suitable for a small apartment, and have a low to moderate activity level. Papillons exhibit minimal barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners.",
      "Japanese Spitz, a small and agile dog breed with a beautiful white coat and a friendly demeanor. They are extremely affectionate companions, suitable for an apartment and a  house with a yard, and require a lot of outdoor activity. Japanese Spitz may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners."
    ]
  },
  {
    "code": "AABABAB",
    "codeIndex": 1121212,
    "id": 30,
    "name": "schipperke",
    "description": "Schipperke, a small and energetic dog breed with a distinctive black coat and fox-like expression. They are extremely affectionate companions, suitable for a small apartment, and have a moderate to high activity level. Schipperkes may bark occasionally and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
  },
  {
    "code": "AABABBA",
    "codeIndex": 1121221,
    "id": 31,
    "name": "schipperke",
    "description": "Schipperke, a small and energetic dog breed with a distinctive black coat and fox-like expression. They are extremely affectionate companions, suitable for a small apartment, and have a moderate to high activity level. Schipperkes may bark occasionally and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
  },
  {
    "code": "AABABBB",
    "codeIndex": 1121222,
    "id": 32,
    "name": "schipperke",
    "description": "Schipperke, a small and energetic dog breed with a distinctive black coat and fox-like expression. They are extremely affectionate companions, suitable for a small apartment, and have a moderate to high activity level. Schipperkes may bark occasionally and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
  },
  {
    "code": "AABBAAA",
    "codeIndex": 1122111,
    "id": 33,
    "name": "schipperke",
    "description": "Schipperke, a small and energetic dog breed with a distinctive black coat and fox-like expression. They are extremely affectionate companions, suitable for a small apartment, and have a moderate to high activity level. Schipperkes may bark occasionally and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
  },
  {
    "code": "AABBAAB",
    "codeIndex": 1122112,
    "id": 34,
    "name": "schipperke",
    "description": "Schipperke, a small and energetic dog breed with a distinctive black coat and fox-like expression. They are extremely affectionate companions, suitable for a small apartment, and have a moderate to high activity level. Schipperkes may bark occasionally and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
  },
  {
    "code": "AABBABA",
    "codeIndex": 1122121,
    "id": 35,
    "name": "beagle",
    "description": "Beagle, a moderately affectionate companion with low grooming needs. Suited for families with older children in homes with yards, offering playful charm."
  },
  {
    "code": "AABBABB",
    "codeIndex": 1122122,
    "id": 36,
    "name": "beagle",
    "description": "Beagle, a moderately affectionate companion with low grooming needs. Suited for families with older children in homes with yards, offering playful charm."
  },
  {
    "code": "AABBBAA",
    "codeIndex": 1122211,
    "id": 37,
    "name": "beagle",
    "description": "Beagle, a moderately affectionate companion with low grooming needs. Suited for families with older children in homes with yards, offering playful charm."
  },
  {
    "code": "AABBBAB",
    "codeIndex": 1122212,
    "id": 38,
    "name": "french bulldog",
    "description": "French Bulldog, an affectionate and low-maintenance companion. Suited for apartments and families with older children, offering charm and a relaxed demeanor."
  },
  {
    "code": "AABBBBA",
    "codeIndex": 1122221,
    "id": 39,
    "name": "french bulldog",
    "description": "French Bulldog, an affectionate and low-maintenance companion. Suited for apartments and families with older children, offering charm and a relaxed demeanor."
  },
  {
    "code": "AABBBBB",
    "codeIndex": 1122222,
    "id": 40,
    "name": "french bulldog",
    "description": "French Bulldog, an affectionate and low-maintenance companion. Suited for apartments and families with older children, offering charm and a relaxed demeanor."
  },
  {
    "code": "AABCAAA",
    "codeIndex": 1123111,
    "id": 41,
    "name": "french bulldog",
    "description": "French Bulldog, an affectionate and low-maintenance companion. Suited for apartments and families with older children, offering charm and a relaxed demeanor."
  },
  {
    "code": "AABCAAB",
    "codeIndex": 1123112,
    "id": 42,
    "name": "french bulldog",
    "description": "French Bulldog, an affectionate and low-maintenance companion. Suited for apartments and families with older children, offering charm and a relaxed demeanor."
  },
  {
    "code": "AABCABA",
    "codeIndex": 1123121,
    "id": 43,
    "name": "french bulldog",
    "description": "French Bulldog, an affectionate and low-maintenance companion. Suited for apartments and families with older children, offering charm and a relaxed demeanor."
  },
  {
    "code": "AABCABB",
    "codeIndex": 1123122,
    "id": 44,
    "name": "french bulldog",
    "description": "French Bulldog, an affectionate and low-maintenance companion. Suited for apartments and families with older children, offering charm and a relaxed demeanor."
  },
  {
    "code": "AABCBAA",
    "codeIndex": 1123211,
    "id": 45,
    "name": "french bulldog",
    "description": "French Bulldog, an affectionate and low-maintenance companion. Suited for apartments and families with older children, offering charm and a relaxed demeanor."
  },
  {
    "code": "AABCBAB",
    "codeIndex": 1123212,
    "id": 46,
    "name": "toy terrier",
    "description": "Toy Terrier, a small and lively dog breed known for its charming personality. They are extemely affectionate, they are suitable for a house with a yard. Toy Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "AABCBBA",
    "codeIndex": 1123221,
    "id": 47,
    "name": "toy terrier",
    "description": "Toy Terrier, a small and lively dog breed known for its charming personality. They are extemely affectionate, they are suitable for a house with a yard. Toy Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "AABCBBB",
    "codeIndex": 1123222,
    "id": 48,
    "name": "toy terrier",
    "description": "Toy Terrier, a small and lively dog breed known for its charming personality. They are extemely affectionate, they are suitable for a house with a yard. Toy Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "ABAAAAA",
    "codeIndex": 1211111,
    "id": 49,
    "name": "toy terrier",
    "description": "Toy Terrier, a small and lively dog breed known for its charming personality. They are extemely affectionate, they are suitable for a house with a yard. Toy Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "ABAAAAB",
    "codeIndex": 1211112,
    "id": 50,
    "name": "toy terrier",
    "description": "Toy Terrier, a small and lively dog breed known for its charming personality. They are extemely affectionate, they are suitable for a house with a yard. Toy Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "ABAAABA",
    "codeIndex": 1211121,
    "id": 51,
    "name": "toy terrier",
    "description": "Toy Terrier, a small and lively dog breed known for its charming personality. They are extemely affectionate, they are suitable for a house with a yard. Toy Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "ABAAABB",
    "codeIndex": 1211122,
    "id": 52,
    "name": "toy terrier",
    "description": "Toy Terrier, a small and lively dog breed known for its charming personality. They are extemely affectionate, they are suitable for a house with a yard. Toy Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "ABAABAA",
    "codeIndex": 1211211,
    "id": 53,
    "name": "toy terrier",
    "description": "Toy Terrier, a small and lively dog breed known for its charming personality. They are extemely affectionate, they are suitable for a house with a yard. Toy Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "ABAABAB",
    "codeIndex": 1211212,
    "id": 54,
    "name": "toy terrier",
    "description": "Toy Terrier, a small and lively dog breed known for its charming personality. They are extemely affectionate, they are suitable for a house with a yard. Toy Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "ABAABBA",
    "codeIndex": 1211221,
    "id": 55,
    "name": [
      "briard",
      "komondor",
      "kuvasz"
    ],
    "description": [
      "Briard, a loyal and energetic companion with high grooming needs. Suited for experienced owners in houses with yards, offering devotion and agility.",
      "Komondor, a unique and dignified dog breed with distinctive corded coat. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Komondors exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them better for experienced owners.",
      "Kuvasz, a loyal and protective dog breed with a dignified demeanor. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Kuvasz dogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, making them better for experienced owners."
    ]
  },
  {
    "code": "ABAABBB",
    "codeIndex": 1211222,
    "id": 56,
    "name": [
      "briard",
      "komondor",
      "kuvasz"
    ],
    "description": [
      "Briard, a loyal and energetic companion with high grooming needs. Suited for experienced owners in houses with yards, offering devotion and agility.",
      "Komondor, a unique and dignified dog breed with distinctive corded coat. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Komondors exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them better for experienced owners.",
      "Kuvasz, a loyal and protective dog breed with a dignified demeanor. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Kuvasz dogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, making them better for experienced owners."
    ]
  },
  {
    "code": "ABABAAA",
    "codeIndex": 1212111,
    "id": 57,
    "name": [
      "briard",
      "komondor",
      "kuvasz"
    ],
    "description": [
      "Briard, a loyal and energetic companion with high grooming needs. Suited for experienced owners in houses with yards, offering devotion and agility.",
      "Komondor, a unique and dignified dog breed with distinctive corded coat. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Komondors exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them better for experienced owners.",
      "Kuvasz, a loyal and protective dog breed with a dignified demeanor. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Kuvasz dogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, making them better for experienced owners."
    ]
  },
  {
    "code": "ABABAAB",
    "codeIndex": 1212112,
    "id": 58,
    "name": [
      "briard",
      "komondor",
      "kuvasz"
    ],
    "description": [
      "Briard, a loyal and energetic companion with high grooming needs. Suited for experienced owners in houses with yards, offering devotion and agility.",
      "Komondor, a unique and dignified dog breed with distinctive corded coat. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Komondors exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them better for experienced owners.",
      "Kuvasz, a loyal and protective dog breed with a dignified demeanor. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Kuvasz dogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, making them better for experienced owners."
    ]
  },
  {
    "code": "ABABABA",
    "codeIndex": 1212121,
    "id": 59,
    "name": [
      "basset hound",
      "blood hound"
    ],
    "description": [
      "Basset Hound, a gentle and affectionate dog breed with a calm demeanor. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Basset Hounds exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners.",
      "Bloodhound, a gentle and affectionate dog breed with a keen sense of smell. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Bloodhounds exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
    ]
  },
  {
    "code": "ABABABB",
    "codeIndex": 1212122,
    "id": 60,
    "name": [
      "basset hound",
      "blood hound"
    ],
    "description": [
      "Basset Hound, a gentle and affectionate dog breed with a calm demeanor. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Basset Hounds exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners.",
      "Bloodhound, a gentle and affectionate dog breed with a keen sense of smell. They are extremely affectionate companions, suitable for a house with a yard, and have a low to moderate activity level. Bloodhounds exhibit occasional barking and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
    ]
  },
  {
    "code": "ABABBAA",
    "codeIndex": 1212211,
    "id": 61,
    "name": "english bulldog",
    "description": "English Bulldog, an affectionate and low-energy companion with moderate grooming needs. Suited for families with older children in houses, offering a laid-back and devoted presence."
  },
  {
    "code": "ABABBAB",
    "codeIndex": 1212212,
    "id": 62,
    "name": "english bulldog",
    "description": "English Bulldog, an affectionate and low-energy companion with moderate grooming needs. Suited for families with older children in houses, offering a laid-back and devoted presence."
  },
  {
    "code": "ABABBBA",
    "codeIndex": 1212221,
    "id": 63,
    "name": "english bulldog",
    "description": "English Bulldog, an affectionate and low-energy companion with moderate grooming needs. Suited for families with older children in houses, offering a laid-back and devoted presence."
  },
  {
    "code": "ABABBBB",
    "codeIndex": 1212222,
    "id": 64,
    "name": "english bulldog",
    "description": "English Bulldog, an affectionate and low-energy companion with moderate grooming needs. Suited for families with older children in houses, offering a laid-back and devoted presence."
  },
  {
    "code": "ABACAAA",
    "codeIndex": 1213111,
    "id": 65,
    "name": "english bulldog",
    "description": "English Bulldog, an affectionate and low-energy companion with moderate grooming needs. Suited for families with older children in houses, offering a laid-back and devoted presence."
  },
  {
    "code": "ABACAAB",
    "codeIndex": 1213112,
    "id": 66,
    "name": "english bulldog",
    "description": "English Bulldog, an affectionate and low-energy companion with moderate grooming needs. Suited for families with older children in houses, offering a laid-back and devoted presence."
  },
  {
    "code": "ABACABA",
    "codeIndex": 1213121,
    "id": 67,
    "name": "english bulldog",
    "description": "English Bulldog, an affectionate and low-energy companion with moderate grooming needs. Suited for families with older children in houses, offering a laid-back and devoted presence."
  },
  {
    "code": "ABACABB",
    "codeIndex": 1213122,
    "id": 68,
    "name": "english bulldog",
    "description": "English Bulldog, an affectionate and low-energy companion with moderate grooming needs. Suited for families with older children in houses, offering a laid-back and devoted presence."
  },
  {
    "code": "ABACBAA",
    "codeIndex": 1213211,
    "id": 69,
    "name": "australian cattledog",
    "description": "Australian Cattle Dog, an intelligent and highly active companion. Suited for active families with yards, offering loyalty and herding instincts, ideal for experienced owners."
  },
  {
    "code": "ABACBAB",
    "codeIndex": 1213212,
    "id": 70,
    "name": "australian cattledog",
    "description": "Australian Cattle Dog, an intelligent and highly active companion. Suited for active families with yards, offering loyalty and herding instincts, ideal for experienced owners."
  },
  {
    "code": "ABACBBA",
    "codeIndex": 1213221,
    "id": 71,
    "name": "australian cattledog",
    "description": "Australian Cattle Dog, an intelligent and highly active companion. Suited for active families with yards, offering loyalty and herding instincts, ideal for experienced owners."
  },
  {
    "code": "ABACBBB",
    "codeIndex": 1213222,
    "id": 72,
    "name": "australian cattledog",
    "description": "Australian Cattle Dog, an intelligent and highly active companion. Suited for active families with yards, offering loyalty and herding instincts, ideal for experienced owners."
  },
  {
    "code": "ABBAAAA",
    "codeIndex": 1221111,
    "id": 73,
    "name": "australian cattledog",
    "description": "Australian Cattle Dog, an intelligent and highly active companion. Suited for active families with yards, offering loyalty and herding instincts, ideal for experienced owners."
  },
  {
    "code": "ABBAAAB",
    "codeIndex": 1221112,
    "id": 74,
    "name": "australian cattledog",
    "description": "Australian Cattle Dog, an intelligent and highly active companion. Suited for active families with yards, offering loyalty and herding instincts, ideal for experienced owners."
  },
  {
    "code": "ABBAABA",
    "codeIndex": 1221121,
    "id": 75,
    "name": "australian cattledog",
    "description": "Australian Cattle Dog, an intelligent and highly active companion. Suited for active families with yards, offering loyalty and herding instincts, ideal for experienced owners."
  },
  {
    "code": "ABBAABB",
    "codeIndex": 1221122,
    "id": 76,
    "name": "australian cattledog",
    "description": "Australian Cattle Dog, an intelligent and highly active companion. Suited for active families with yards, offering loyalty and herding instincts, ideal for experienced owners."
  },
  {
    "code": "ABBABAA",
    "codeIndex": 1221211,
    "id": 77,
    "name": "australian cattledog",
    "description": "Australian Cattle Dog, an intelligent and highly active companion. Suited for active families with yards, offering loyalty and herding instincts, ideal for experienced owners."
  },
  {
    "code": "ABBABAB",
    "codeIndex": 1221212,
    "id": 78,
    "name": [
      "groenendael",
      "golden retriever",
      "samoyed",
      "stbernard"
    ],
    "description": [
      "Groenendael, an intelligent and energetic dog breed with a loyal nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Groenendaels may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Golden Retriever, a friendly and intelligent dog breed known for its gentle nature and beautiful golden coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Golden Retrievers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for novice owners.",
      "Samoyed, a friendly and gentle dog breed with a beautiful white coat and a distinctive 'Sammy smile.' They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Samoyeds may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners.",
      "St. Bernard, a gentle giant and loyal dog breed with a calm demeanor. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. St. Bernards may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners."
    ]
  },
  {
    "code": "ABBABBA",
    "codeIndex": 1221221,
    "id": 79,
    "name": [
      "groenendael",
      "golden retriever",
      "samoyed",
      "stbernard"
    ],
    "description": [
      "Groenendael, an intelligent and energetic dog breed with a loyal nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Groenendaels may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Golden Retriever, a friendly and intelligent dog breed known for its gentle nature and beautiful golden coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Golden Retrievers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for novice owners.",
      "Samoyed, a friendly and gentle dog breed with a beautiful white coat and a distinctive 'Sammy smile.' They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Samoyeds may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners.",
      "St. Bernard, a gentle giant and loyal dog breed with a calm demeanor. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. St. Bernards may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners."
    ]
  },
  {
    "code": "ABBABBB",
    "codeIndex": 1221222,
    "id": 80,
    "name": [
      "groenendael",
      "golden retriever",
      "samoyed",
      "stbernard"
    ],
    "description": [
      "Groenendael, an intelligent and energetic dog breed with a loyal nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Groenendaels may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Golden Retriever, a friendly and intelligent dog breed known for its gentle nature and beautiful golden coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Golden Retrievers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for novice owners.",
      "Samoyed, a friendly and gentle dog breed with a beautiful white coat and a distinctive 'Sammy smile.' They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Samoyeds may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners.",
      "St. Bernard, a gentle giant and loyal dog breed with a calm demeanor. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. St. Bernards may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners."
    ]
  },
  {
    "code": "ABBBAAA",
    "codeIndex": 1222111,
    "id": 81,
    "name": [
      "groenendael",
      "golden retriever",
      "samoyed",
      "stbernard"
    ],
    "description": [
      "Groenendael, an intelligent and energetic dog breed with a loyal nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Groenendaels may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Golden Retriever, a friendly and intelligent dog breed known for its gentle nature and beautiful golden coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Golden Retrievers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for novice owners.",
      "Samoyed, a friendly and gentle dog breed with a beautiful white coat and a distinctive 'Sammy smile.' They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Samoyeds may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners.",
      "St. Bernard, a gentle giant and loyal dog breed with a calm demeanor. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. St. Bernards may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for novice owners."
    ]
  },
  {
    "code": "ABBBAAB",
    "codeIndex": 1222112,
    "id": 82,
    "name": [
      "shepherd australian",
      "bluetick",
      "bouvier",
      "entlebucher",
      "english hound",
      "plott hound",
      "kelpie",
      "leonberger",
      "bernese mountain",
      "swiss mountain",
      "newfoundland",
      "germanlonghair pointer",
      "pyrenees",
      "curly retriever",
      "flat-coated retriever",
      "italian segugio",
      "english setter",
      "gordon setter",
      "irish setter",
      "english sheepdog",
      "shetland sheepdog",
      "brittany spaniel",
      "cocker spaniel",
      "irish spaniel",
      "sussex spaniel",
      "welsh spaniel",
      "english springer",
      "border terrier",
      "cairn terrier",
      "patterdale terrier",
      "scottish terrier",
      "tibetan terrier",
      "tervuren",
      "vizsla",
      "spanish waterdog",
      "weimaraner",
      "irish wolfhound"
    ],
    "description": [
      "Australian Shepherd, an affectionate and high-energy dog ideal for active families with yards. Grooming demands moderate experience, promising a devoted and intelligent companion.",
      "Bluetick, an affectionate companion with low grooming needs. Suited for families with older children in homes with yards, offering a charming and loyal presence.",
      "Bouvier, a loyal and energetic companion with high grooming needs. Suited for experienced owners in houses, providing loyalty and a lively family member.",
      "Entlebucher, a lively and intelligent dog breed with a strong work ethic. They are affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Entlebuchers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, making them better for experienced owners.",
      "English Foxhound, an energetic and friendly dog breed known for its endurance and strong sense of smell. They are affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. English Foxhounds may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Plott Hound, a loyal and confident dog breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Plott Hounds may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Kelpie, an intelligent and energetic dog breed known for its herding abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Kelpies may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Leonberger, a gentle giant with a friendly and outgoing nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Leonbergers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Bernese Mountain Dog, a gentle giant with a calm and affectionate demeanor. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Bernese Mountain Dogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Greater Swiss Mountain Dog, a strong and gentle dog breed with a friendly and loyal nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Greater Swiss Mountain Dogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Newfoundland, a gentle giant with a sweet and patient nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Newfoundlands may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "German Longhaired Pointer, a versatile and friendly hunting dog breed with a gentle nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. German Longhaired Pointers may bark occasionally and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Great Pyrenees, a gentle giant and loyal dog breed with a calm demeanor. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Great Pyrenees may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Curly-Coated Retriever, a confident and independent dog breed known for its unique curly coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Curly-Coated Retrievers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Flat-Coated Retriever, a friendly and exuberant dog breed known for its long, glossy coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Flat-Coated Retrievers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Italian Segugio, a skilled and independent hound breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Italian Segugios may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "English Setter, a gentle and friendly dog breed with an elegant appearance. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. English Setters may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Gordon Setter, a loyal and dignified dog breed known for its distinctive black and tan coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Gordon Setters may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Irish Setter, a friendly and outgoing dog breed known for its beautiful mahogany coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Irish Setters may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Old English Sheepdog, a friendly and intelligent dog breed known for its distinctive shaggy coat and bobtail. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Old English Sheepdogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Shetland Sheepdog, an intelligent and energetic dog breed known for its agility and beautiful coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Shetland Sheepdogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Brittany Spaniel, an energetic and friendly dog breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Brittany Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Cocker Spaniel, a friendly and affectionate dog breed with a distinctive coat and expressive eyes. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Cocker Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Irish Water Spaniel, an intelligent and energetic dog breed known for its curly, water-resistant coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Irish Water Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Sussex Spaniel, a friendly and affectionate dog breed known for its distinctive golden liver-colored coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Sussex Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Welsh Springer Spaniel, a friendly and energetic dog breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Welsh Springer Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "English Springer Spaniel, a friendly and energetic dog breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. English Springer Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Border Terrier, a friendly and intelligent dog breed known for its sturdy build. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Border Terriers may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Cairn Terrier, a cheerful and adventurous dog breed with a distinctive shaggy coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Cairn Terriers may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Patterdale Terrier, an energetic and adventurous dog breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Patterdale Terriers may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Scottish Terrier, a dignified and independent dog breed known for its distinctive appearance. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Scottish Terriers may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Tibetan Terrier, an intelligent and friendly dog breed with a distinctive coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Tibetan Terriers may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Tervuren, an intelligent and energetic dog breed with a striking appearance and a thick double coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Tervurens may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Vizsla, an energetic and affectionate dog breed known for its hunting abilities and sleek, golden coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Vizslas may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Spanish Water Dog, an intelligent and versatile working dog breed known for its curly coat and herding instincts. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Spanish Water Dogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Weimaraner, a graceful and intelligent dog breed known for its distinctive silver-gray coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Weimaraners may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Irish Wolfhound, a gentle giant and loyal dog breed known for its impressive size and friendly nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Irish Wolfhounds may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "ABBBABA",
    "codeIndex": 1222121,
    "id": 83,
    "name": [
      "shepherd australian",
      "bluetick",
      "bouvier",
      "entlebucher",
      "english hound",
      "plott hound",
      "kelpie",
      "leonberger",
      "bernese mountain",
      "swiss mountain",
      "newfoundland",
      "germanlonghair pointer",
      "pyrenees",
      "curly retriever",
      "flat-coated retriever",
      "italian segugio",
      "english setter",
      "gordon setter",
      "irish setter",
      "english sheepdog",
      "shetland sheepdog",
      "brittany spaniel",
      "cocker spaniel",
      "irish spaniel",
      "sussex spaniel",
      "welsh spaniel",
      "english springer",
      "border terrier",
      "cairn terrier",
      "patterdale terrier",
      "scottish terrier",
      "tibetan terrier",
      "tervuren",
      "vizsla",
      "spanish waterdog",
      "weimaraner",
      "irish wolfhound"
    ],
    "description": [
      "Australian Shepherd, an affectionate and high-energy dog ideal for active families with yards. Grooming demands moderate experience, promising a devoted and intelligent companion.",
      "Bluetick, an affectionate companion with low grooming needs. Suited for families with older children in homes with yards, offering a charming and loyal presence.",
      "Bouvier, a loyal and energetic companion with high grooming needs. Suited for experienced owners in houses, providing loyalty and a lively family member.",
      "Entlebucher, a lively and intelligent dog breed with a strong work ethic. They are affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Entlebuchers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, making them better for experienced owners.",
      "English Foxhound, an energetic and friendly dog breed known for its endurance and strong sense of smell. They are affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. English Foxhounds may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Plott Hound, a loyal and confident dog breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Plott Hounds may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Kelpie, an intelligent and energetic dog breed known for its herding abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Kelpies may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Leonberger, a gentle giant with a friendly and outgoing nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Leonbergers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Bernese Mountain Dog, a gentle giant with a calm and affectionate demeanor. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Bernese Mountain Dogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Greater Swiss Mountain Dog, a strong and gentle dog breed with a friendly and loyal nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Greater Swiss Mountain Dogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Newfoundland, a gentle giant with a sweet and patient nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Newfoundlands may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "German Longhaired Pointer, a versatile and friendly hunting dog breed with a gentle nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. German Longhaired Pointers may bark occasionally and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Great Pyrenees, a gentle giant and loyal dog breed with a calm demeanor. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Great Pyrenees may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Curly-Coated Retriever, a confident and independent dog breed known for its unique curly coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Curly-Coated Retrievers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Flat-Coated Retriever, a friendly and exuberant dog breed known for its long, glossy coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Flat-Coated Retrievers may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Italian Segugio, a skilled and independent hound breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Italian Segugios may bark occasionally and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "English Setter, a gentle and friendly dog breed with an elegant appearance. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. English Setters may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Gordon Setter, a loyal and dignified dog breed known for its distinctive black and tan coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Gordon Setters may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Irish Setter, a friendly and outgoing dog breed known for its beautiful mahogany coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Irish Setters may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Old English Sheepdog, a friendly and intelligent dog breed known for its distinctive shaggy coat and bobtail. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Old English Sheepdogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Shetland Sheepdog, an intelligent and energetic dog breed known for its agility and beautiful coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Shetland Sheepdogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Brittany Spaniel, an energetic and friendly dog breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Brittany Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Cocker Spaniel, a friendly and affectionate dog breed with a distinctive coat and expressive eyes. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Cocker Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Irish Water Spaniel, an intelligent and energetic dog breed known for its curly, water-resistant coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Irish Water Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Sussex Spaniel, a friendly and affectionate dog breed known for its distinctive golden liver-colored coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Sussex Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Welsh Springer Spaniel, a friendly and energetic dog breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Welsh Springer Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "English Springer Spaniel, a friendly and energetic dog breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. English Springer Spaniels may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Border Terrier, a friendly and intelligent dog breed known for its sturdy build. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Border Terriers may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Cairn Terrier, a cheerful and adventurous dog breed with a distinctive shaggy coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Cairn Terriers may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Patterdale Terrier, an energetic and adventurous dog breed known for its hunting abilities. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Patterdale Terriers may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Scottish Terrier, a dignified and independent dog breed known for its distinctive appearance. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Scottish Terriers may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Tibetan Terrier, an intelligent and friendly dog breed with a distinctive coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Tibetan Terriers may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Tervuren, an intelligent and energetic dog breed with a striking appearance and a thick double coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Tervurens may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Vizsla, an energetic and affectionate dog breed known for its hunting abilities and sleek, golden coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Vizslas may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Spanish Water Dog, an intelligent and versatile working dog breed known for its curly coat and herding instincts. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Spanish Water Dogs may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Weimaraner, a graceful and intelligent dog breed known for its distinctive silver-gray coat. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Weimaraners may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners.",
      "Irish Wolfhound, a gentle giant and loyal dog breed known for its impressive size and friendly nature. They are extremely affectionate companions, suitable for a house with a yard, and require a lot of outdoor activity. Irish Wolfhounds may bark occasionally and are generally suitable for families with children. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "ABBBABB",
    "codeIndex": 1222122,
    "id": 84,
    "name": "boxer",
    "description": "Boxer, an affectionate and high-energy companion with moderate grooming needs. Suited for families with older children in homes with yards, offering playful enthusiasm."
  },
  {
    "code": "ABBBBAA",
    "codeIndex": 1222211,
    "id": 85,
    "name": "staffordshire bullterrier",
    "description": "Staffordshire Bull Terrier, an affectionate and energetic companion. Suited for families with older children and homes with yards, offering loyalty and playfulness."
  },
  {
    "code": "ABBBBAB",
    "codeIndex": 1222212,
    "id": 86,
    "name": "staffordshire bullterrier",
    "description": "Staffordshire Bull Terrier, an affectionate and energetic companion. Suited for families with older children and homes with yards, offering loyalty and playfulness."
  },
  {
    "code": "ABBBBBA",
    "codeIndex": 1222221,
    "id": 87,
    "name": "norwegian buhund",
    "description": "Norwegian Buhund is an affectionate, moderately active companion with moderate grooming needs. Suited for families with older children in houses with yards, offering loyalty and vitality."
  },
  {
    "code": "ABBBBBB",
    "codeIndex": 1222222,
    "id": 88,
    "name": "norwegian buhund",
    "description": "Norwegian Buhund is an affectionate, moderately active companion with moderate grooming needs. Suited for families with older children in houses with yards, offering loyalty and vitality."
  },
  {
    "code": "ABBCAAA",
    "codeIndex": 1223111,
    "id": 89,
    "name": "norwegian buhund",
    "description": "Norwegian Buhund is an affectionate, moderately active companion with moderate grooming needs. Suited for families with older children in houses with yards, offering loyalty and vitality."
  },
  {
    "code": "ABBCAAB",
    "codeIndex": 1223112,
    "id": 90,
    "name": "norwegian buhund",
    "description": "Norwegian Buhund is an affectionate, moderately active companion with moderate grooming needs. Suited for families with older children in houses with yards, offering loyalty and vitality."
  },
  {
    "code": "ABBCABA",
    "codeIndex": 1223121,
    "id": 91,
    "name": "appenzeller",
    "description": "Appenzeller, an energetic, vocal companion with minimal grooming needs. Suited for active owners in houses, providing a lively and devoted family member."
  },
  {
    "code": "ABBCABB",
    "codeIndex": 1223122,
    "id": 92,
    "name": "appenzeller",
    "description": "Appenzeller, an energetic, vocal companion with minimal grooming needs. Suited for active owners in houses, providing a lively and devoted family member."
  },
  {
    "code": "ABBCBAA",
    "codeIndex": 1223211,
    "id": 93,
    "name": "appenzeller",
    "description": "Appenzeller, an energetic, vocal companion with minimal grooming needs. Suited for active owners in houses, providing a lively and devoted family member."
  },
  {
    "code": "ABBCBAB",
    "codeIndex": 1223212,
    "id": 94,
    "name": "dalmatian",
    "description": "Dalmatian, an energetic and outgoing dog breed known for its distinctive coat with spots. Dalmatians are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. They may be naturally vocal and are better suited for experienced owners."
  },
  {
    "code": "ABBCBBA",
    "codeIndex": 1223221,
    "id": 95,
    "name": "dalmatian",
    "description": "Dalmatian, an energetic and outgoing dog breed known for its distinctive coat with spots. Dalmatians are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. They may be naturally vocal and are better suited for experienced owners."
  },
  {
    "code": "ABBCBBB",
    "codeIndex": 1223222,
    "id": 96,
    "name": "coonhound",
    "description": "Coonhound, a friendly and sociable dog known for its excellent hunting skills and distinctive baying vocalization. It is well-suited for an active lifestyle and requires moderate grooming."
  },
  {
    "code": "BAAAAAA",
    "codeIndex": 2111111,
    "id": 97,
    "name": "italian greyhound",
    "description": "Italian Greyhound, a graceful and affectionate dog breed with a sweet nature. They are suitable for a small apartment. Italian Greyhounds have a low to moderate activity level, minimal barking, and are generally suitable for families with children. Grooming is consistent, making them suitable for novice owners."
  },
  {
    "code": "BAAAAAB",
    "codeIndex": 2111112,
    "id": 98,
    "name": "scottish deerhound",
    "description": "Scottish Deerhound, a gentle and dignified dog breed with a friendly nature. They are less affectionate, making them suitable for a house with a yard. Scottish Deerhounds have a low to moderate activity level, minimal barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, but they are better suited for experienced owners."
  },
  {
    "code": "BAAAABA",
    "codeIndex": 2111121,
    "id": 99,
    "name": "scottish deerhound",
    "description": "Scottish Deerhound, a gentle and dignified dog breed with a friendly nature. They are less affectionate, making them suitable for a house with a yard. Scottish Deerhounds have a low to moderate activity level, minimal barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, but they are better suited for experienced owners."
  },
  {
    "code": "BAAAABB",
    "codeIndex": 2111122,
    "id": 100,
    "name": "great dane",
    "description": "Great Dane, a gentle giant and affectionate dog breed with a calm demeanor. Great Danes are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, minimal barking, and are generally suitable for families with children when well-socialized. Grooming is low maintenance, but they are better suited for experienced owners."
  },
  {
    "code": "BAAABAA",
    "codeIndex": 2111211,
    "id": 101,
    "name": "great dane",
    "description": "Great Dane, a gentle giant and affectionate dog breed with a calm demeanor. Great Danes are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, minimal barking, and are generally suitable for families with children when well-socialized. Grooming is low maintenance, but they are better suited for experienced owners."
  },
  {
    "code": "BAAABAB",
    "codeIndex": 2111212,
    "id": 102,
    "name": "great dane",
    "description": "Great Dane, a gentle giant and affectionate dog breed with a calm demeanor. Great Danes are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, minimal barking, and are generally suitable for families with children when well-socialized. Grooming is low maintenance, but they are better suited for experienced owners."
  },
  {
    "code": "BAAABBA",
    "codeIndex": 2111221,
    "id": 103,
    "name": "great dane",
    "description": "Great Dane, a gentle giant and affectionate dog breed with a calm demeanor. Great Danes are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, minimal barking, and are generally suitable for families with children when well-socialized. Grooming is low maintenance, but they are better suited for experienced owners."
  },
  {
    "code": "BAAABBB",
    "codeIndex": 2111222,
    "id": 104,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAABAAA",
    "codeIndex": 2112111,
    "id": 105,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAABAAB",
    "codeIndex": 2112112,
    "id": 106,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAABABA",
    "codeIndex": 2112121,
    "id": 107,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAABABB",
    "codeIndex": 2112122,
    "id": 108,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAABBAA",
    "codeIndex": 2112211,
    "id": 109,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAABBAB",
    "codeIndex": 2112212,
    "id": 110,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAABBBA",
    "codeIndex": 2112221,
    "id": 111,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAABBBB",
    "codeIndex": 2112222,
    "id": 112,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAACAAA",
    "codeIndex": 2113111,
    "id": 113,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAACAAB",
    "codeIndex": 2113112,
    "id": 114,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAACABA",
    "codeIndex": 2113121,
    "id": 115,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAACABB",
    "codeIndex": 2113122,
    "id": 116,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAACBAA",
    "codeIndex": 2113211,
    "id": 117,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAACBAB",
    "codeIndex": 2113212,
    "id": 118,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAACBBA",
    "codeIndex": 2113221,
    "id": 119,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BAACBBB",
    "codeIndex": 2113222,
    "id": 120,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BABAAAA",
    "codeIndex": 2121111,
    "id": 121,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BABAAAB",
    "codeIndex": 2121112,
    "id": 122,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BABAABA",
    "codeIndex": 2121121,
    "id": 123,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BABAABB",
    "codeIndex": 2121122,
    "id": 124,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BABABAA",
    "codeIndex": 2121211,
    "id": 125,
    "name": "doberman",
    "description": "Doberman, a loyal and intelligent dog breed known for its sleek appearance and protective instincts. Dobermans are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners."
  },
  {
    "code": "BABABAB",
    "codeIndex": 2121212,
    "id": 126,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABABBA",
    "codeIndex": 2121221,
    "id": 127,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABABBB",
    "codeIndex": 2121222,
    "id": 128,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABBAAA",
    "codeIndex": 2122111,
    "id": 129,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABBAAB",
    "codeIndex": 2122112,
    "id": 130,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABBABA",
    "codeIndex": 2122121,
    "id": 131,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABBABB",
    "codeIndex": 2122122,
    "id": 132,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABBBAA",
    "codeIndex": 2122211,
    "id": 133,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABBBAB",
    "codeIndex": 2122212,
    "id": 134,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABBBBA",
    "codeIndex": 2122221,
    "id": 135,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABBBBB",
    "codeIndex": 2122222,
    "id": 136,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABCAAA",
    "codeIndex": 2123111,
    "id": 137,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABCAAB",
    "codeIndex": 2123112,
    "id": 138,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABCABA",
    "codeIndex": 2123121,
    "id": 139,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABCABB",
    "codeIndex": 2123122,
    "id": 140,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABCBAA",
    "codeIndex": 2123211,
    "id": 141,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABCBAB",
    "codeIndex": 2123212,
    "id": 142,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABCBBA",
    "codeIndex": 2123221,
    "id": 143,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BABCBBB",
    "codeIndex": 2123222,
    "id": 144,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BBAAAAA",
    "codeIndex": 2211111,
    "id": 145,
    "name": "Clumber",
    "description": "Clumber, a gentle giant and affectionate companion. House with yard. Low to moderate activity. Minimal barking. Suitable for children. Requires consistent grooming. Novice-friendly."
  },
  {
    "code": "BBAAAAB",
    "codeIndex": 2211112,
    "id": 146,
    "name": "walker hound",
    "description": "Treeing Walker Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Treeing Walker Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "BBAAABA",
    "codeIndex": 2211121,
    "id": 147,
    "name": "walker hound",
    "description": "Treeing Walker Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Treeing Walker Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "BBAAABB",
    "codeIndex": 2211122,
    "id": 148,
    "name": "walker hound",
    "description": "Treeing Walker Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Treeing Walker Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "BBAABAA",
    "codeIndex": 2211211,
    "id": 149,
    "name": "ibizan hound",
    "description": "Ibizan Hound, an intelligent and agile dog breed with a lively and friendly nature. They are less affectionate, making them suitable for a house with a yard. Ibizan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "BBAABAB",
    "codeIndex": 2211212,
    "id": 150,
    "name": "ibizan hound",
    "description": "Ibizan Hound, an intelligent and agile dog breed with a lively and friendly nature. They are less affectionate, making them suitable for a house with a yard. Ibizan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "BBAABBA",
    "codeIndex": 2211221,
    "id": 151,
    "name": "ibizan hound",
    "description": "Ibizan Hound, an intelligent and agile dog breed with a lively and friendly nature. They are less affectionate, making them suitable for a house with a yard. Ibizan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners."
  },
  {
    "code": "BBAABBB",
    "codeIndex": 2211222,
    "id": 152,
    "name": "whippet",
    "description": "Whippet, a gentle and affectionate dog breed known for its sleek and slender appearance. They are less affectionate, making them suitable for a house with a yard. Whippets have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for novice owners."
  },
  {
    "code": "BBABAAA",
    "codeIndex": 2212111,
    "id": 153,
    "name": "whippet",
    "description": "Whippet, a gentle and affectionate dog breed known for its sleek and slender appearance. They are less affectionate, making them suitable for a house with a yard. Whippets have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for novice owners."
  },
  {
    "code": "BBABAAB",
    "codeIndex": 2212112,
    "id": 154,
    "name": [
      "Border Collie",
      "germanshepherd",
      "husky",
      "malamute",
      "bull mastiff",
      "english mastiff",
      "tibetan mastiff",
      "otterhound",
      "german pointer",
      "chesapeake retriever",
      "rhodesian ridgeback",
      "rottweiler",
      "saluki",
      "giant schnauzer",
      "miniature schnauzer",
      "shiba",
      "american terrier",
      "australian terrier",
      "bedlington terrier",
      "dandie terrier",
      "fox terrier",
      "irish terrier",
      "kerryblue terrier",
      "lakeland terrier",
      "norfolk terrier",
      "norwich terrier",
      "silky terrier",
      "welsh terrier",
      "wheaten terrier"
    ],
    "description": [
      "Border Collie, an intelligent and energetic companion. House with yard. Requires a lot of outdoor activity. Occasional barking. Suitable for children. Consistent grooming. Better for experienced owners.",
      "German Shepherd, a loyal and intelligent dog breed known for its versatility and protective instincts. German Shepherds are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Husky, a friendly and energetic dog breed with a striking appearance. They are less affectionate, making them suitable for a house with a yard. Huskies have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Alaskan Malamute, a strong and independent dog breed with a friendly demeanor. They are less affectionate, making them suitable for a house with a yard. Malamutes have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Bull Mastiff, a gentle giant and loyal dog breed with a calm demeanor. They are less affectionate, making them suitable for a house with a yard. Bull Mastiffs have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, making them better for experienced owners.",
      "English Mastiff, a gentle giant and loyal dog breed with a calm demeanor. They are less affectionate, making them suitable for a house with a yard. English Mastiffs have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, making them better for experienced owners.",
      "Tibetan Mastiff, a powerful and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Tibetan Mastiffs have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, making them better for experienced owners.",
      "Otterhound, a friendly and boisterous dog breed known for its keen sense of smell. They are less affectionate, making them suitable for a house with a yard. Otterhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "German Shorthaired Pointer, an energetic and versatile hunting dog breed with a friendly and intelligent nature. They are less affectionate, making them suitable for a house with a yard. German Shorthaired Pointers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Chesapeake Bay Retriever, a loyal and versatile dog breed known for its hunting abilities. They are less affectionate, making them suitable for a house with a yard. Chesapeake Bay Retrievers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Rhodesian Ridgeback, a strong and dignified dog breed known for its distinctive ridge of hair along its back. They are less affectionate, making them suitable for a house with a yard. Rhodesian Ridgebacks have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Rottweiler, a loyal and confident dog breed with a strong and muscular build. They are less affectionate, making them suitable for a house with a yard. Rottweilers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Saluki, an elegant and independent dog breed known for its grace and speed. They are less affectionate, making them suitable for a house with a yard. Salukis have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Giant Schnauzer, a powerful and intelligent dog breed with a distinctive beard and eyebrows. They are less affectionate, making them suitable for a house with a yard. Giant Schnauzers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Miniature Schnauzer, a small and spirited dog breed with a distinctive beard and bushy eyebrows. They are less affectionate, making them suitable for a house with a yard. Miniature Schnauzers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Shiba Inu, a spirited and independent dog breed with a bold personality. They are less affectionate, making them suitable for a house with a yard. Shiba Inus have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "American Terrier, a spirited and confident dog breed known for its intelligence and agility. They are less affectionate, making them suitable for a house with a yard. American Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Australian Terrier, a small and sturdy dog breed with a lively personality. They are less affectionate, making them suitable for a house with a yard. Australian Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Bedlington Terrier, a graceful and affectionate dog breed known for its distinctive lamb-like appearance. They are less affectionate, making them suitable for a house with a yard. Bedlington Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Dandie Dinmont Terrier, a unique and dignified dog breed with a distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Dandie Dinmont Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Fox Terrier, a lively and spirited dog breed known for its agility and intelligence. They are less affectionate, making them suitable for a house with a yard. Fox Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Irish Terrier, a spirited and bold dog breed with a distinctive wiry coat. They are less affectionate, making them suitable for a house with a yard. Irish Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Kerry Blue Terrier, an intelligent and energetic dog breed with a distinctive blue coat. They are less affectionate, making them suitable for a house with a yard. Kerry Blue Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Lakeland Terrier, a friendly and confident dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Lakeland Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Norfolk Terrier, a small and lively dog breed known for its affectionate nature. They are less affectionate, making them suitable for a house with a yard. Norfolk Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Norwich Terrier, a small and alert dog breed known for its friendly disposition. They are less affectionate, making them suitable for a house with a yard. Norwich Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Silky Terrier, a small and elegant dog breed with a beautiful silky coat. They are less affectionate, making them suitable for a house with a yard. Silky Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Welsh Terrier, a friendly and spirited dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Welsh Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Wheaten Terrier, a friendly and versatile dog breed known for its soft, silky coat. They are less affectionate, making them suitable for a house with a yard. Wheaten Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBABABA",
    "codeIndex": 2212121,
    "id": 155,
    "name": [
      "Border Collie",
      "germanshepherd",
      "husky",
      "malamute",
      "bull mastiff",
      "english mastiff",
      "tibetan mastiff",
      "otterhound",
      "german pointer",
      "chesapeake retriever",
      "rhodesian ridgeback",
      "rottweiler",
      "saluki",
      "giant schnauzer",
      "miniature schnauzer",
      "shiba",
      "american terrier",
      "australian terrier",
      "bedlington terrier",
      "dandie terrier",
      "fox terrier",
      "irish terrier",
      "kerryblue terrier",
      "lakeland terrier",
      "norfolk terrier",
      "norwich terrier",
      "silky terrier",
      "welsh terrier",
      "wheaten terrier"
    ],
    "description": [
      "Border Collie, an intelligent and energetic companion. House with yard. Requires a lot of outdoor activity. Occasional barking. Suitable for children. Consistent grooming. Better for experienced owners.",
      "German Shepherd, a loyal and intelligent dog breed known for its versatility and protective instincts. German Shepherds are less affectionate, making them suitable for a house with a yard. They have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Husky, a friendly and energetic dog breed with a striking appearance. They are less affectionate, making them suitable for a house with a yard. Huskies have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Alaskan Malamute, a strong and independent dog breed with a friendly demeanor. They are less affectionate, making them suitable for a house with a yard. Malamutes have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Bull Mastiff, a gentle giant and loyal dog breed with a calm demeanor. They are less affectionate, making them suitable for a house with a yard. Bull Mastiffs have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, making them better for experienced owners.",
      "English Mastiff, a gentle giant and loyal dog breed with a calm demeanor. They are less affectionate, making them suitable for a house with a yard. English Mastiffs have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, making them better for experienced owners.",
      "Tibetan Mastiff, a powerful and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Tibetan Mastiffs have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, making them better for experienced owners.",
      "Otterhound, a friendly and boisterous dog breed known for its keen sense of smell. They are less affectionate, making them suitable for a house with a yard. Otterhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "German Shorthaired Pointer, an energetic and versatile hunting dog breed with a friendly and intelligent nature. They are less affectionate, making them suitable for a house with a yard. German Shorthaired Pointers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Chesapeake Bay Retriever, a loyal and versatile dog breed known for its hunting abilities. They are less affectionate, making them suitable for a house with a yard. Chesapeake Bay Retrievers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Rhodesian Ridgeback, a strong and dignified dog breed known for its distinctive ridge of hair along its back. They are less affectionate, making them suitable for a house with a yard. Rhodesian Ridgebacks have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Rottweiler, a loyal and confident dog breed with a strong and muscular build. They are less affectionate, making them suitable for a house with a yard. Rottweilers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Saluki, an elegant and independent dog breed known for its grace and speed. They are less affectionate, making them suitable for a house with a yard. Salukis have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Giant Schnauzer, a powerful and intelligent dog breed with a distinctive beard and eyebrows. They are less affectionate, making them suitable for a house with a yard. Giant Schnauzers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Miniature Schnauzer, a small and spirited dog breed with a distinctive beard and bushy eyebrows. They are less affectionate, making them suitable for a house with a yard. Miniature Schnauzers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Shiba Inu, a spirited and independent dog breed with a bold personality. They are less affectionate, making them suitable for a house with a yard. Shiba Inus have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "American Terrier, a spirited and confident dog breed known for its intelligence and agility. They are less affectionate, making them suitable for a house with a yard. American Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Australian Terrier, a small and sturdy dog breed with a lively personality. They are less affectionate, making them suitable for a house with a yard. Australian Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Bedlington Terrier, a graceful and affectionate dog breed known for its distinctive lamb-like appearance. They are less affectionate, making them suitable for a house with a yard. Bedlington Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Dandie Dinmont Terrier, a unique and dignified dog breed with a distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Dandie Dinmont Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Fox Terrier, a lively and spirited dog breed known for its agility and intelligence. They are less affectionate, making them suitable for a house with a yard. Fox Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Irish Terrier, a spirited and bold dog breed with a distinctive wiry coat. They are less affectionate, making them suitable for a house with a yard. Irish Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Kerry Blue Terrier, an intelligent and energetic dog breed with a distinctive blue coat. They are less affectionate, making them suitable for a house with a yard. Kerry Blue Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Lakeland Terrier, a friendly and confident dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Lakeland Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Norfolk Terrier, a small and lively dog breed known for its affectionate nature. They are less affectionate, making them suitable for a house with a yard. Norfolk Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Norwich Terrier, a small and alert dog breed known for its friendly disposition. They are less affectionate, making them suitable for a house with a yard. Norwich Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Silky Terrier, a small and elegant dog breed with a beautiful silky coat. They are less affectionate, making them suitable for a house with a yard. Silky Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Welsh Terrier, a friendly and spirited dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Welsh Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners.",
      "Wheaten Terrier, a friendly and versatile dog breed known for its soft, silky coat. They are less affectionate, making them suitable for a house with a yard. Wheaten Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBABABB",
    "codeIndex": 2212122,
    "id": 156,
    "name": "russell terrier",
    "description": "Russell Terrier, a spirited and intelligent dog breed known for its agility and bold personality. They are less affectionate, making them suitable for a house with a yard. Russell Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is low maintenance, and they are better for experienced owners."
  },
  {
    "code": "BBABBAA",
    "codeIndex": 2212211,
    "id": 157,
    "name": "russell terrier",
    "description": "Russell Terrier, a spirited and intelligent dog breed known for its agility and bold personality. They are less affectionate, making them suitable for a house with a yard. Russell Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is low maintenance, and they are better for experienced owners."
  },
  {
    "code": "BBABBAB",
    "codeIndex": 2212212,
    "id": 158,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBABBBA",
    "codeIndex": 2212221,
    "id": 159,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBABBBB",
    "codeIndex": 2212222,
    "id": 160,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBACAAA",
    "codeIndex": 2213111,
    "id": 161,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBACAAB",
    "codeIndex": 2213112,
    "id": 162,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBACABA",
    "codeIndex": 2213121,
    "id": 163,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBACABB",
    "codeIndex": 2213122,
    "id": 164,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBACBAA",
    "codeIndex": 2213211,
    "id": 165,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBACBAB",
    "codeIndex": 2213212,
    "id": 166,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBACBBA",
    "codeIndex": 2213221,
    "id": 167,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBACBBB",
    "codeIndex": 2213222,
    "id": 168,
    "name": [
      "afghan hound",
      "caucasian ovcharka",
      "westhighland terrier"
    ],
    "description": [
      "Afghan Hound, an elegant and independent dog breed with a dignified presence. They are less affectionate, making them suitable for a house with a yard. Afghan Hounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Caucasian Ovcharka, a strong and independent dog breed with a protective nature. They are less affectionate, making them suitable for a house with a yard. Caucasian Ovcharkas have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized from an early age. Grooming is consistent, and they are better for experienced owners.",
      "West Highland White Terrier, a confident and friendly dog breed known for its distinctive white coat. They are less affectionate, making them suitable for a house with a yard. West Highland White Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBAAAA",
    "codeIndex": 2221111,
    "id": 169,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBAAAB",
    "codeIndex": 2221112,
    "id": 170,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBAABA",
    "codeIndex": 2221121,
    "id": 171,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBAABB",
    "codeIndex": 2221122,
    "id": 172,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBABAA",
    "codeIndex": 2221211,
    "id": 173,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBABAB",
    "codeIndex": 2221212,
    "id": 174,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBABBA",
    "codeIndex": 2221221,
    "id": 175,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBABBB",
    "codeIndex": 2221222,
    "id": 176,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBBAAA",
    "codeIndex": 2222111,
    "id": 177,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBBAAB",
    "codeIndex": 2222112,
    "id": 178,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBBABA",
    "codeIndex": 2222121,
    "id": 179,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBBABB",
    "codeIndex": 2222122,
    "id": 180,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBBBAA",
    "codeIndex": 2222211,
    "id": 181,
    "name": [
      "airedale",
      "finnish lapphund",
      "malinois",
      "redbone",
      "sealyham terrier"
    ],
    "description": [
      "Airedale, a loyal and moderately active companion, suitable for families with older children. Requires grooming and a house with a yard.",
      "Finnish Lapphund, a friendly and adaptable dog breed with a gentle nature. They are less affectionate, making them suitable for a house with a yard. Finnish Lapphunds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-socialized. Grooming is consistent, and they are better for experienced owners.",
      "Belgian Malinois, an intelligent and energetic dog breed known for its versatility. They are less affectionate, making them suitable for a house with a yard. Malinois have high activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Redbone Coonhound, a friendly and energetic dog breed known for its hunting skills. They are less affectionate, making them suitable for a house with a yard. Redbone Coonhounds have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better suited for experienced owners.",
      "Sealyham Terrier, a confident and friendly dog breed known for its distinctive appearance. They are less affectionate, making them suitable for a house with a yard. Sealyham Terriers have a low to moderate activity level, occasional barking, and are generally suitable for families with children when well-trained. Grooming is consistent, and they are better for experienced owners."
    ]
  },
  {
    "code": "BBBBBAB",
    "codeIndex": 2222212,
    "id": 182,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "BBBBBBA",
    "codeIndex": 2222221,
    "id": 183,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "BBBBBBB",
    "codeIndex": 2222222,
    "id": 184,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "BBBCAAA",
    "codeIndex": 2223111,
    "id": 185,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "BBBCAAB",
    "codeIndex": 2223112,
    "id": 186,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "BBBCABA",
    "codeIndex": 2223121,
    "id": 187,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "BBBCABB",
    "codeIndex": 2223122,
    "id": 188,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "BBBCBAA",
    "codeIndex": 2223211,
    "id": 189,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "BBBCBAB",
    "codeIndex": 2223212,
    "id": 190,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "BBBCBBA",
    "codeIndex": 2223221,
    "id": 191,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "BBBCBBB",
    "codeIndex": 2223222,
    "id": 192,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAAAAAA",
    "codeIndex": 3111111,
    "id": 193,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAAAAAB",
    "codeIndex": 3111112,
    "id": 194,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAAAABA",
    "codeIndex": 3111121,
    "id": 195,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAAAABB",
    "codeIndex": 3111122,
    "id": 196,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAAABAA",
    "codeIndex": 3111211,
    "id": 197,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAAABAB",
    "codeIndex": 3111212,
    "id": 198,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAAABBA",
    "codeIndex": 3111221,
    "id": 199,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAAABBB",
    "codeIndex": 3111222,
    "id": 200,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAABAAA",
    "codeIndex": 3112111,
    "id": 201,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAABAAB",
    "codeIndex": 3112112,
    "id": 202,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAABABA",
    "codeIndex": 3112121,
    "id": 203,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAABABB",
    "codeIndex": 3112122,
    "id": 204,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAABBAA",
    "codeIndex": 3112211,
    "id": 205,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAABBAB",
    "codeIndex": 3112212,
    "id": 206,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAABBBA",
    "codeIndex": 3112221,
    "id": 207,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAABBBB",
    "codeIndex": 3112222,
    "id": 208,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAACAAA",
    "codeIndex": 3113111,
    "id": 209,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAACAAB",
    "codeIndex": 3113112,
    "id": 210,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAACABA",
    "codeIndex": 3113121,
    "id": 211,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAACABB",
    "codeIndex": 3113122,
    "id": 212,
    "name": "norwegian elkhound",
    "description": "Norwegian Elkhound, a strong and resilient dog breed with a friendly demeanor. They are affectionate companions, thrive in a house with a yard, and require a lot of outdoor activity. Norwegian Elkhounds may be naturally vocal but are generally suitable for families with children, especially when well-socialized."
  },
  {
    "code": "CAACBAA",
    "codeIndex": 3113211,
    "id": 213,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CAACBAB",
    "codeIndex": 3113212,
    "id": 214,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CAACBBA",
    "codeIndex": 3113221,
    "id": 215,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CAACBBB",
    "codeIndex": 3113222,
    "id": 216,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABAAAA",
    "codeIndex": 3121111,
    "id": 217,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABAAAB",
    "codeIndex": 3121112,
    "id": 218,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABAABA",
    "codeIndex": 3121121,
    "id": 219,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABAABB",
    "codeIndex": 3121122,
    "id": 220,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABABAA",
    "codeIndex": 3121211,
    "id": 221,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABABAB",
    "codeIndex": 3121212,
    "id": 222,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABABBA",
    "codeIndex": 3121221,
    "id": 223,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABABBB",
    "codeIndex": 3121222,
    "id": 224,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABBAAA",
    "codeIndex": 3122111,
    "id": 225,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABBAAB",
    "codeIndex": 3122112,
    "id": 226,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABBABA",
    "codeIndex": 3122121,
    "id": 227,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABBABB",
    "codeIndex": 3122122,
    "id": 228,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABBBAA",
    "codeIndex": 3122211,
    "id": 229,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABBBAB",
    "codeIndex": 3122212,
    "id": 230,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABBBBA",
    "codeIndex": 3122221,
    "id": 231,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABBBBB",
    "codeIndex": 3122222,
    "id": 232,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABCAAA",
    "codeIndex": 3123111,
    "id": 233,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABCAAB",
    "codeIndex": 3123112,
    "id": 234,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABCABA",
    "codeIndex": 3123121,
    "id": 235,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABCABB",
    "codeIndex": 3123122,
    "id": 236,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABCBAA",
    "codeIndex": 3123211,
    "id": 237,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABCBAB",
    "codeIndex": 3123212,
    "id": 238,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABCBBA",
    "codeIndex": 3123221,
    "id": 239,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CABCBBB",
    "codeIndex": 3123222,
    "id": 240,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBAAAAA",
    "codeIndex": 3211111,
    "id": 241,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBAAAAB",
    "codeIndex": 3211112,
    "id": 242,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBAAABA",
    "codeIndex": 3211121,
    "id": 243,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBAAABB",
    "codeIndex": 3211122,
    "id": 244,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBAABAA",
    "codeIndex": 3211211,
    "id": 245,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBAABAB",
    "codeIndex": 3211212,
    "id": 246,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBAABBA",
    "codeIndex": 3211221,
    "id": 247,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBAABBB",
    "codeIndex": 3211222,
    "id": 248,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBABAAA",
    "codeIndex": 3212111,
    "id": 249,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBABAAB",
    "codeIndex": 3212112,
    "id": 250,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBABABA",
    "codeIndex": 3212121,
    "id": 251,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBABABB",
    "codeIndex": 3212122,
    "id": 252,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBABBAA",
    "codeIndex": 3212211,
    "id": 253,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBABBAB",
    "codeIndex": 3212212,
    "id": 254,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBABBBA",
    "codeIndex": 3212221,
    "id": 255,
    "name": "basenji",
    "description": "Basenji, an independent and vocal companion with low grooming needs. Suited for experienced owners in apartments or small living spaces."
  },
  {
    "code": "CBABBBB",
    "codeIndex": 3212222,
    "id": 256,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBACAAA",
    "codeIndex": 3213111,
    "id": 257,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBACAAB",
    "codeIndex": 3213112,
    "id": 258,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBACABA",
    "codeIndex": 3213121,
    "id": 259,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBACABB",
    "codeIndex": 3213122,
    "id": 260,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBACBAA",
    "codeIndex": 3213211,
    "id": 261,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBACBAB",
    "codeIndex": 3213212,
    "id": 262,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBACBBA",
    "codeIndex": 3213221,
    "id": 263,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBACBBB",
    "codeIndex": 3213222,
    "id": 264,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBAAAA",
    "codeIndex": 3221111,
    "id": 265,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBAAAB",
    "codeIndex": 3221112,
    "id": 266,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBAABA",
    "codeIndex": 3221121,
    "id": 267,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBAABB",
    "codeIndex": 3221122,
    "id": 268,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBABAA",
    "codeIndex": 3221211,
    "id": 269,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBABAB",
    "codeIndex": 3221212,
    "id": 270,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBABBA",
    "codeIndex": 3221221,
    "id": 271,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBABBB",
    "codeIndex": 3221222,
    "id": 272,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBBAAA",
    "codeIndex": 3222111,
    "id": 273,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBBAAB",
    "codeIndex": 3222112,
    "id": 274,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBBABA",
    "codeIndex": 3222121,
    "id": 275,
    "name": "akita",
    "description": "Akita, a quiet, loyal dog with high activity levels. Best for experienced owners in homes with yards, providing a strong and affectionate bond."
  },
  {
    "code": "CBBBABB",
    "codeIndex": 3222122,
    "id": 276,
    "name": "borzoi",
    "description": "Borzoi, an independent and low-energy companion with moderate grooming needs. Suited for experienced owners in apartments, offering grace and loyalty."
  },
  {
    "code": "CBBBBAA",
    "codeIndex": 3222211,
    "id": 277,
    "name": "borzoi",
    "description": "Borzoi, an independent and low-energy companion with moderate grooming needs. Suited for experienced owners in apartments, offering grace and loyalty."
  },
  {
    "code": "CBBBBAB",
    "codeIndex": 3222212,
    "id": 278,
    "name": "borzoi",
    "description": "Borzoi, an independent and low-energy companion with moderate grooming needs. Suited for experienced owners in apartments, offering grace and loyalty."
  },
  {
    "code": "CBBBBBA",
    "codeIndex": 3222221,
    "id": 279,
    "name": "borzoi",
    "description": "Borzoi, an independent and low-energy companion with moderate grooming needs. Suited for experienced owners in apartments, offering grace and loyalty."
  },
  {
    "code": "CBBBBBB",
    "codeIndex": 3222222,
    "id": 280,
    "name": "borzoi",
    "description": "Borzoi, an independent and low-energy companion with moderate grooming needs. Suited for experienced owners in apartments, offering grace and loyalty."
  },
  {
    "code": "CBBCAAA",
    "codeIndex": 3223111,
    "id": 281,
    "name": "Chow",
    "description": "Meet the majestic Chow: dignified and independent, thrives in a home with a yard, enjoys moderate activity, has a distinctive vocal side, requires regular grooming, and best suited for experienced owners."
  },
  {
    "code": "CBBCAAB",
    "codeIndex": 3223112,
    "id": 282,
    "name": "Chow",
    "description": "Meet the majestic Chow: dignified and independent, thrives in a home with a yard, enjoys moderate activity, has a distinctive vocal side, requires regular grooming, and best suited for experienced owners."
  },
  {
    "code": "CBBCABA",
    "codeIndex": 3223121,
    "id": 283,
    "name": "Chow",
    "description": "Meet the majestic Chow: dignified and independent, thrives in a home with a yard, enjoys moderate activity, has a distinctive vocal side, requires regular grooming, and best suited for experienced owners."
  },
  {
    "code": "CBBCABB",
    "codeIndex": 3223122,
    "id": 284,
    "name": "Chow",
    "description": "Meet the majestic Chow: dignified and independent, thrives in a home with a yard, enjoys moderate activity, has a distinctive vocal side, requires regular grooming, and best suited for experienced owners."
  },
  {
    "code": "CBBCBAA",
    "codeIndex": 3223211,
    "id": 285,
    "name": "Chow",
    "description": "Meet the majestic Chow: dignified and independent, thrives in a home with a yard, enjoys moderate activity, has a distinctive vocal side, requires regular grooming, and best suited for experienced owners."
  },
  {
    "code": "CBBCBAB",
    "codeIndex": 3223212,
    "id": 286,
    "name": "Chow",
    "description": "Meet the majestic Chow: dignified and independent, thrives in a home with a yard, enjoys moderate activity, has a distinctive vocal side, requires regular grooming, and best suited for experienced owners."
  },
  {
    "code": "CBBCBBA",
    "codeIndex": 3223221,
    "id": 287,
    "name": "Chow",
    "description": "Meet the majestic Chow: dignified and independent, thrives in a home with a yard, enjoys moderate activity, has a distinctive vocal side, requires regular grooming, and best suited for experienced owners."
  },
  {
    "code": "CBBCBBB",
    "codeIndex": 3223222,
    "id": 288,
    "name": "Chow",
    "description": "Meet the majestic Chow: dignified and independent, thrives in a home with a yard, enjoys moderate activity, has a distinctive vocal side, requires regular grooming, and best suited for experienced owners."
  }
]